
import pandas as pd
import numpy as np


# Создание данных для DataFrame
data = {
    'Продукт': [
        'Грецкие орехи 100 гр', 'Кешью 100 гр', 'Авокадо 100 гр', 'Киви 100 гр', 
        'Ядро кедрового ореха 100 гр', 'Яйцо 1 шт.', 'Говядина 100 гр', 'Свинина 100 гр', 
        'Баранина 100 гр', 'Лосось 100 гр', 'Куриная грудка 100 гр', 'Грудка индейки 100 гр', 
        'Сельдерей 100 гр', 'Огурцы 100 гр', 'Помидоры 100 гр' , 'Йогурт белый 100 гр', 'Отруби ржаные 100'
    ],
    'Калории на 100 гр продукта': [
        654, 553, 160, 61, 673, 68, 250, 297, 
        294, 208, 165, 104, 16, 15, 18, 81, 182
    ],
    'Белки (г)': [
        15, 18, 2, 1.14, 13.7, 6, 26, 27, 
        25, 20, 23, 22, 0.7, 0.65, 0.88, 5, 13.2
    ],
    'Жиры (г)': [
        65, 44, 15, 0.52, 68.4, 4.75, 12, 21, 
        24, 13, 1.7, 1, 0.17, 0.11, 0.2, 3.5, 3.2
    ],
    'Углеводы (г)': [
        14, 30, 9, 14.66, 13.1, 0.36, 0, 0, 
        0, 0, 0, 0, 3.5, 2.8, 3.9, 7.4, 25
    ],
    'Клетчатка (г)': [
        6.7, 3.3, 6.7, 3, 3.7, 0, 0, 0, 
        0, 0, 0, 0, 1.6, 0.5, 1.2, 0, 37
    ],
    'Витамин C (мг)': [
        1.3, 0.5, 10, 92.7, 0.8, 0, 0, 0, 
        0, 0, 0, 0, 3.1, 2.8, 13.7, 0, 0
    ],
    'Калий (мг)': [
        441, 660, 485, 312, 597, 69, 350, 337, 
        370, 363, 256, 239, 260, 147, 237, 0, 0
    ],
    'Магний (мг)': [
        158, 292, 29, 17, 251, 6, 21, 19, 
        22, 25, 25, 23, 11, 13, 11, 0, 0
    ]
}

# Создание DataFrame
df = pd.DataFrame(data)

# Добавление колонок "Итого" с пустыми значениями
df['Итого Калории'] = np.nan
df['Итого Белки'] = np.nan
df['Итого Жиры'] = np.nan
df['Итого Углеводы'] = np.nan
df['Итого Клетчатка'] = np.nan          
df['Итого Витамин C'] = np.nan
df['Итого Калий'] = np.nan
df['Итого Магний'] = np.nan

# Сохранение DataFrame в файл Excel
# df.to_excel("nutrition_data.xlsx", index=False)

print(df)  # Показать DataFrame
