import pandas as pd
import numpy as np

# Создание данных для DataFrame
data = {
    'Продукт': [
        'Грецкие орехи 100 гр', 'Кешью 100 гр', 'Авокадо 100 гр', 'Киви 100 гр', 
        'Ядро кедрового ореха 100 гр', 'Яйцо 1 шт.', 'Говядина 100 гр', 'Свинина 100 гр', 
        'Баранина 100 гр', 'Лосось 100 гр', 'Куриная грудка 100 гр', 'Грудка индейки 100 гр', 
        'Сельдерей 100 гр', 'Огурцы 1 шт.', 'Помидоры 1 шт.'
    ],
    'Калории на 100 гр продукта': [
        654, 553, 160, 61, 673, 68, 250, 260, 
        294, 208, 165, 135, 16, 10, 18
    ],
    'Белки (г)': [
        15, 18, 2, 1.14, 13.7, 6, 26, 25, 
        25, 20, 31, 29, 0.7, 0.65, 0.88
    ],
    'Жиры (г)': [
        65, 44, 15, 0.52, 68.4, 4.75, 15, 21, 
        24, 13, 3.6, 0.7, 0.17, 0.11, 0.2
    ],
    'Углеводы (г)': [
        14, 30, 9, 14.66, 13.1, 0.36, 0, 0, 
        0, 0, 0, 0, 1.9, 1.8, 3.9
    ],
    'Клетчатка (г)': [
        6.7, 3.3, 6.7, 3, 3.7, 0, 0, 0, 
        0, 0, 0, 0, 1.6, 0.5, 1.2
    ],
    'Витамин C (мг)': [
        1.3, 0.5, 10, 92.7, 0.8, 0, 0, 0, 
        0, 0, 0, 0, 3.1, 2.8, 12.7
    ],
    'Калий (мг)': [
        441, 660, 485, 312, 597, 69, 350, 340, 
        370, 363, 256, 237, 260, 140, 237
    ],
    'Магний (мг)': [
        158, 292, 29, 17, 251, 6, 21, 19, 
        22, 25, 25, 23, 11, 7, 11
    ]
}

# Создание DataFrame
df = pd.DataFrame(data)

# Сохранение DataFrame в файл Excel
df.to_excel("nutrition_data.xlsx", index=False)

print(df)  # Показать DataFrame
